Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: Objective-C frameworks can use custom error domains and enumerations to group related categories of errors.
ja: Objective-Cフレームワークは、カスタムエラードメインと列挙を使って、エラーの関連カテゴリをグループ化します。

source: Objective-C frameworks vend APIs in header files.
ja: Objective-Cフレームワークは、ヘッダ・ファイルの中のAPIを販売します。

source: Objective-C initializers begin with init, or initWith: if the initializer takes one or more arguments.
ja: Objective-Cイニシャライザは、initで、またはイニシャライザがひとつ以上の引数をとるならばinitWith:で始まります。

source: Objective-C initializers that indicate whether they’re failable are imported as either init(...)—if initialization cannot fail—or init?(...)—if initialization can fail.
ja: それらが失敗できるかどうか指し示すObjective-Cイニシャライザは、初期化が失敗できないならば ― init(...)、または初期化が失敗できるならば ― init?(...)、このどちらかでインポートされます。

source: Objective-C methods that return a value and take no arguments can be called like an Objective-C property using dot syntax.
ja: 値を返して引数を取らないObjective-Cメソッドは、Objective-Cプロパティのように呼び出すことがドット構文を使って行えます。

source: Objective-C platform-adaptive integer types, such as NSUInteger and NSInteger, are bridged to Int.
ja: Objective-Cのプラットホーム順応性の整数型、例えばNSUIntegerとNSIntegerなどは、Intにブリッジされます。

source: Objective-C property declarations using the @property syntax are imported as Swift properties in the following way:
ja: Objective-Cプロパティ宣言で@property構文を使っているものは、スウィフトプロパティとして以下の方法でインポートされます：

source: Objective-C protocol-qualified metaclasses are imported by Swift as protocol metatypes.
ja: Objective-Cのプロトコル適格メタクラスは、スウィフトによってプロトコルメタタイプとしてインポートされます。

source: Objective-C protocols are imported as Swift protocols, which can be adopted by a class in a comma-separated list following the name of a class’s superclass, if any.
ja: Objective-Cプロトコルは、スウィフトプロトコルとしてインポートされます、そしてそれは、クラスによって採用されることが、もしあればクラスのもつスーパークラスの名前に続けて、コンマ区切りのリストに入れて、可能です。

source: Objective-C type declarations using lightweight generic parameterization are imported by Swift with information about the type of their contents preserved.
ja: 軽量総称体パラメーター化を使っているObjective-C宣言は、それらの保管される内容についての情報を使ってスウィフトによってインポートされます。

source: Objects in an app’s responder chain—that is, subclasses of NSResponder on macOS and UIResponder on iOS—have a read-only undoManager property that returns an optional NSUndoManager value, which manages the undo stack for the app.
ja: アプリのレスポンダ連鎖の中のオブジェクト ― すなわち、macOSでのNSResponderそしてiOSでのUIResponderのサブクラス ― は、読み出し専用のundoManagerプロパティを持ちます、それはオプショナルのNSUndoManager値を返します、そして取り消しスタックをアプリのために管理します。

source: On macOS, you typically open an app by clicking its icon in the Dock or Launchpad, or by double-clicking its icon from the Finder.
ja: macOSでは、あなたは通常はアプリをそれのアイコンをDockまたはLaunchpadでクリックすることで、またはそれのアイコンをFinderからダブルクリックすることで開きます。

source: Once you import your Swift code into Objective-C, use regular Objective-C syntax for working with Swift classes.
ja: 一旦あなたがObjective-Cにあなたのスウィフトコードをインポートするならば、一般的なObjective-C構文をスウィフトクラスを扱うために使ってください。

source: Once you migrate a class to Swift, you must remove the corresponding .m file from the target before building to avoid a duplicate symbol error.
ja: 一旦あなたがあるクラスをスウィフトに移行したならば、あなたは、ビルドの前にそのターゲットから対応する.mファイルを取り除いて重複シンボル・エラーを避けなければなりません。

source: One aid in writing well-designed, resilient apps is to use Cocoa’s established design patterns.
ja: よく設計された、溌剌としたアプリを記述することでの１つの援助は、ココアのいくつかの確立したデザインパターンを使うことです。

source: One important aspect of interoperability is that it lets you work with Objective-C APIs when writing Swift code.
ja: 相互運用性の１つの重要な面は、スウィフトコードを書くとき、それがあなたにObjective-C APIを扱わせるということです。

source: One of the primary advantages of value types over reference types is that they make it easier to reason about your code.
ja: 参照型を超える値型の主要な利点の１つは、それらがあなたのコードについて考えるのをより簡単にすることです。

source: One-Time Initialization
ja: ワンタイム初期化

source: Only Swift function types with C function reference calling convention may be used for function pointer arguments.
ja: C関数参照呼出手法を持つスウィフト関数型だけが、関数ポインタ引数のために使われます。

source: Option Sets
ja: オプションセット

source: Option sets behave like Swift’s Set collection type.
ja: オプションセットは、スウィフトのSetコレクション型に似た振る舞いをします。

source: Option sets behave similarly to imported enumerations by truncating their prefixes to option value names.
ja: オプションセットは、それらのオプション値名の接頭辞を切り取ることでインポートされた列挙と同じように振舞います。

source: Option-click a symbol to see implicit information about it, like its type, attributes, and documentation comments.
ja: シンボルをオプション-クリックして、それに関する暗黙表示の情報、その型、属性、そして注釈文書などを見てください。

source: Optional pointers cannot be passed to the withVaList(_:invoke:) function.
ja: オプショナルポインタは、withVaList(_:invoke:)関数に渡されることが可能ではありません。

source: Or, an app may require more complex usage in order to use localization resources from a separate bundle:
ja: または、独立したバンドルから現地語化リソースを使うために、アプリはより複雑な語法を必要とするかもしれません：

source: Other methods are imported with double underscores (__) prepended to their base names.
ja: 他のメソッドは、二重アンダースコア（__）をそれのベース名の前に付けられてインポートされます。

source: Otherwise, Objective-C initializers are imported as init!(...).
ja: それ以外では、Objective-Cイニシャライザは、init!(...)としてインポートされます。

source: Otherwise, Swift bridges the optional as its unwrapped value.
ja: そうでなければ、スウィフトはそのオプショナルをそれのアンラップされた値としてブリッジします。

source: Otherwise, continue on to learn about working with unmanaged Core Foundation objects.
ja: 一方で、管理されないコアファウンデーション・オブジェクトを扱うことについて学ぶためには続けてください。

source: Otherwise, if no convention can be inferred, the method is left intact.
ja: それ以外では、推論されることができる慣行がないならば、メソッドは元のままにしておかれます。

source: Outlets and actions allow you to connect your source code to user interface objects in Interface Builder.
ja: アウトレットとアクションによって、あなたは、あなたのソース・コードをインタフェースビルダーのユーザー・インタフェースオブジェクトに接続することができます。

source: Overriding Swift Names for Objective-C Interfaces
ja: Objective-Cインターフェイスのためのスウィフト名のオーバーライド

source: Platform-specific classes, such as NSBackgroundActivity, NSUserNotification, and NSXPCConnection
ja: プラットホーム特有のクラス、例えばNSBackgroundActivity、NSUserNotification、そしてNSXPCConnectionなど。

source: Pointer Arithmetic
ja: ポインタ算術

source: Pointer initializers taking the integer representation of an address in memory are failable.
ja: メモリ中のあるアドレスの整数表現をとるポインタイニシャライザは失敗可能です。

source: Pointers
ja: ポインター

source: Preparing Your Objective-C Code for Migration
ja: 移動のためのあなたのObjective-Cコードの準備

source: Preprocessor Directives
ja: プリプロセッサ指令

source: Primitive Types
ja: 基本の型

source: Print the return value of the method.
ja: メソッドの戻り値を出力する。

source: Private declarations are not exposed to Objective-C unless they are explicitly marked with @IBAction, @IBOutlet, or @objc.
ja: プライベートな宣言はObjective-Cにさらされません、それらが明示的に@IBAction、@IBOutlet、または@objcで印されない限りは。

source: Processing Command-Line Arguments
ja: コマンドライン引数の処理

source: Properties with an ownership property attribute other than weak (that is, assign, copy, strong, or unsafe_unretained) are imported as Swift properties with the appropriate storage.
ja: weakとは別の所有者プロパティ属性（すなわち、assign、copy、strong、またはunsafe_unretained）を持つプロパティは、スウィフトプロパティとしてインポートされるのに適切なストレージを使います。

source: Properties with the class property attribute are imported as Swift type properties.
ja: classプロパティ属性を持つプロパティは、スウィフト型プロパティとしてインポートされます。

source: Properties with the readonly property attribute are imported as Swift computed properties with a getter ({ get }).
ja: readonlyプロパティ属性を使うプロパティは、スウィフト計算プロパティとしてインポートされるのにゲッター（{ get }）を使います。

source: Properties with the weak property attribute are imported as Swift properties marked with the weak keyword (weak var).
ja: weakプロパティ属性を使うプロパティは、weakキーワード（weak var）で印されるスウィフトプロパティとしてインポートされます。

source: Properties with the nullability property attributes (nonnull, nullable, and null_resettable) are imported as Swift properties with optional or nonoptional type as described in Nullability and Optionals.
ja: ヌル許可プロパティ属性（nonnull、nullable、そしてnull_resettable）を使ったプロパティは、スウィフトプロパティとしてインポートされるのにオプショナルまたは非オプショナル型を使います、ヌル許可とオプショナルで記述されるように。

source: Protocol-Qualified Classes
ja: プロトコル適格クラス

source: Rather than defining separate functions that correspond to each Objective-C macro, the Swift NSLocalizedString(_:tableName:bundle:value:) function specifies default values for the tableName, bundle, and value arguments, so that they may be overridden as necessary.
ja: それぞれのObjective-Cマクロに対応した独立した関数を定義するのではなく、スウィフトのNSLocalizedString(_:tableName:bundle:value:)関数はtableName、bundle、そしてvalue引数に省略時の値を指定します、それでそれらは必要に応じてオーバーライドされることができます。

source: Read/Write and Read-Only
ja: 「読み/書き」と「読み出し専用」

source: Referencing a Swift Class or Protocol in an Objective-C Header
ja: スウィフトのクラスやプロトコルをObjective-Cヘッダにおいて参照する

source: Refining Objective-C Declarations
ja: Objective-C宣言を改良する

source: Remap certain Objective-C concepts to matching concepts in Swift, like pointers to optionals
ja: 特定のObjective-C概念をスウィフトでの匹敵する概念にリマップします、ポインターをオプショナルへ、のように

source: Remap certain Objective-C core types to their alternatives in Swift, like NSString to String
ja: 特定のObjective-Cコア型をスウィフトでのそれらの代替物にリマップします、NSStringをStringへ、のように

source: Remap certain Objective-C types to their equivalents in Swift, like id to Any
ja: 特定のObjective-C型をそれらのスウィフトでの等価物にリマップ（関数を別のキーに割り当てる）します、idをAnyに、のように

source: Remapped Types
ja: リマップされた型

source: Remember that you cannot subclass a Swift class in Objective-C.
ja: あなたがObjective-Cにおいてスウィフトクラスをサブクラス化することができないことを忘れないでください。

source: Remember to add a colon (:) wherever a parameter follows a selector piece.
ja: あるセレクタ片にパラメータが続くところはどこにでも、コロン（:）を加えるのを忘れないでください。

source: Remove the original Objective-C .m file from the target by deselecting the target membership checkbox.
ja: ターゲットから本来のObjective-C .mファイルを、ターゲットメンバーシップ・チェックボックスの選択を外すことによって取り除いてください。

source: Renamed Types
ja: 改名された型

source: Requiring Dynamic Dispatch
ja: 動的なディスパッチを要求する

source: Requiring this kind of dynamic dispatch is rarely necessary.
ja: この種の動的なディスパッチの要請は、めったに必要ではありません。

source: Revision History
ja: 改訂履歴

source: See Data Type Size Calculation for more information about how Swift calculates the sizes of data types and values.
ja: データ型サイズ計算をスウィフトがデータ型と値の大きさを計算する方法についての詳細のために見てください。

source: See Unmanaged Objects for more information.
ja: 更なる情報として管理されないオブジェクトを見てください。

source: Selectors
ja: セレクタ

source: Serialization
ja: シリアライズ

source: Serialization allows you to encode and decode objects in your app to and from architecture-independent representations, such as JSON or property lists.
ja: シリアライズは、オブジェクトをあなたのアプリにおいてアーキテクチャ非依存の表現、例えばJSONやプロパティリストなどに符号化および復号化できるようにします。

source: Sets
ja: 集合

source: Setting Up Your Swift Environment
ja: あなたのスウィフト環境を設定する

source: Similarly, NSSet declarations without a class-qualified object type are imported by Swift as a Set with the Element type AnyHashable.
ja: 同様に、クラス適格オブジェクト型なしでのNSSet宣言は、スウィフトによってElement型AnyHashableを持つSetとしてインポートされます。

source: Similarly, if an error producing Objective-C method returns a nil value to indicate the failure of a method call, Swift changes the return type of the function to a nonoptional type.
ja: 同様に、エラーを生成しているObjective-Cメソッドがnil値を返してメソッド呼び出しの失敗を指し示すならば、スウィフトは関数の戻り型を非オプショナル型に変えます。

source: Similarly, you can use the JSONDecoder and PropertyListDecoder classes to decode and initialize instances from JSON or property list data.
ja: 同様に、あなたはJSONDecoderとPropertyListDecoderクラスを使って、インスタンスをJSONまたはプロパティリストデータからデコードして初期化します。

source: Similarly, you use the #available availability condition to conditionally execute code based on required platform and version conditions.
ja: 同様に、あなたは#available利用可能性条件を使うことで、必要なプラットホームおよびバージョン条件に基づいて、条件付きでコードを実行します。

source: Simple Macros
ja: 単純なマクロ

source: Simplified the instructions in the Basic Setup chapter.
ja: いくつかの指示を基本の準備章において簡略化した。

source: Simply import the appropriate module, and refer to the class, structure, or enumeration by the same name that you would use in Objective-C.
ja: 単に適切なモジュールをインポートしてください、そしてあなたがObjective-Cで使うだろうのと同じ名前によって、そのクラス、構造体、または列挙を参照してください。

source: Singleton
ja: シングルトン

source: Singletons provide a globally accessible, shared instance of an object.
ja: シングルトンは、全体で利用できる、共有されるひとつのインスタンスを、あるオブジェクトに提供します。

source: Some Objective-C interfaces may not be suitable or necessary to be exposed as Swift interfaces.
ja: いくつかのObjective-Cインターフェイスは、スウィフトインターフェイスとして露出されるのにふさわしくないもしくは必要でない可能性があります。

source: Some Swift APIs do not map back to Objective-C because they leverage language features that are not available in Objective-C.
ja: スウィフト若干のAPIは、Objective-Cへと逆にマップされません、なぜならそれらがObjective-Cで利用できない言語機能に影響を及ぼすからです。

source: Some classes and methods are not available to all versions of all platforms that your app targets.
ja: いくつかのクラスやメソッドは、あなたのアプリターゲットであるすべてのプラットホームのすべてのバージョンで利用可能ではありません。

source: Specifying Property Attributes
ja: プロパティ属性を指定する

source: Strings
ja: 文字列

source: Strong and Weak
ja: 強い、弱い

source: Structures
ja: 構造体

source: Structures defined in Swift
ja: スウィフトにおいて定義される構造体

source: Subclasses of classes that adopt NSCoding that have one or more custom initializers or any properties without initial values must also implement this method.
ja: NSCodingを採用するクラスのサブクラスで１つ以上のカスタムイニシャライザまたはなんらかの初期値なしのプロパティを持つものは、同様にこのメソッドを実装しなければなりません。

source: Swift APIs are translated into Objective-C similar to how Objective-C APIs are translated into Swift, but in reverse:
ja: スウィフトのAPIは、Objective-C APIがスウィフトへと翻訳される方法と同じように、しかし逆に、Objective-Cへと翻訳されます：

source: Swift APIs that are callable from Objective-C must be accessible through dynamic dispatch.
ja: Objective-Cから呼び出し可能なスウィフトAPIは、動的ディスパッチを通してアクセス可能でなければなりません。

source: Swift Syntax
ja: スウィフト構文

source: Swift Type
ja: スウィフト型

source: Swift Type Compatibility
ja: スウィフト型互換性

source: Swift Value Type
ja: スウィフト値型

source: Swift also bridges between the Dictionary type and the NSDictionary class.
ja: スウィフトはまた、Dictionary型からNSDictionaryクラスへ橋渡しします。

source: Swift also imports C enumerations marked with the NS_OPTIONS macro as a Swift option set.
ja: スウィフトはまた、NS_OPTIONSマクロで印を付けられるCの列挙をスウィフトオプションセットとしてインポートします。

source: Swift also includes an AnyObject type that represents some kind of object and has the special ability to look up any @objc method dynamically.
ja: スウィフトはまたAnyObject型を含んでいます。それは何かわからないある種類のオブジェクトを表します、そしてどれかの@objcメソッドを動的に検索する特別な能力を持ちます。

source: Swift also provides a way of working with common C constructs and patterns, in case your code requires it.
ja: スウィフトはまた、あなたのコードがそれを必要とする場合に備えて、一般的なC構造物とパターンを扱う方法を提供します。

source: Swift also provides pointer types for working with buffers, which are discussed in Buffer Pointers.
ja: スウィフトはまたバッファを扱うためにいくつかのポインタ型を提供します、それらはバッファポインタにおいて解説されます。

source: Swift and Objective-C in the Same Project
ja: 同じプロジェクト中のスウィフトとObjective-C

source: Swift automatically calls the superclass deinitializer after invoking your subclass’ deinitializer.
ja: スウィフトは、あなたのサブクラスのデイニシャライザを呼び出した後、自動的にスーパークラスのデイニシャライザを呼び出します。

source: Swift automatically converts some Objective-C types to Swift types, and some Swift types to Objective-C types.
ja: スウィフトは、いくつかのObjective-C型をスウィフト型に、そしていくつかのスウィフト型をObjective-C型に自動的に変換します。

source: Swift automatically provides implementations for the logical complements of the equality and identity operators (!= and !==).
ja: スウィフトは、同等性と同一性演算子の論理上当然な補完物（!=と!==）に対する実装を自動的に提供します。

source: Swift automatically synthesizes conformance to the Equatable protocol for imported C enumeration types.
ja: スウィフトは、インポートされたC列挙型に対して自動的にEquatableプロトコルへの準拠を合成します。

source: Swift automatically translates Objective-C methods that produce errors into methods that throw an error according to Swift’s native error handling functionality.
ja: スウィフトは、自動的にエラーを生成するObjective-Cメソッドを、スウィフト固有のエラー処理機能に従ってエラーをスローするメソッドに翻訳します。

source: Swift bridges between the Array type and the NSArray class.
ja: スウィフトは、Array型とNSArrayクラスの間での橋渡しをします。

source: Swift bridges between the NSNumber class and Swift numeric types, including Int, Double, and Bool.
ja: スウィフトはNSNumberクラスと、Int、Double、およびBoolを含むスウィフト数値型の間をブリッジします。

source: Swift bridges between the String type and the NSString class.
ja: スフィフトは、String型とNSStringクラスの間をブリッジします。

source: Swift bridges optional values to nonnullable Objective-C objects according to whether the optional contains an underlying, wrapped value.
ja: スウィフトは、オプショナル値をnull不可Objective-Cオブジェクトへと、そのオプショナルがその下に隠している、ラップされた値を持つかどうかに従ってブリッジします。

source: Swift classes are namespaced based on the module they are compiled in, even when used from Objective-C code.
ja: スウィフトクラスは、それらがコンパイルされているモジュールに基づく名前空間に置かれます、Objective-Cコードから使用される時でさえもです。

source: Swift closures and Objective-C blocks are compatible, so you can pass Swift closures to Objective-C methods that expect blocks.
ja: スウィフトのクロージャとObjective-Cのブロックは互換性を持つので、ブロックを要求するObjective-Cメソッドに、あなたはスウィフトクロージャを渡すことができます。

source: Swift closures and functions have the same type, so you can even pass the name of a Swift function.
ja: スウィフトのクロージャと関数は同じ型を持つので、あなたはスウィフト関数の名前を渡しさえすることができます。

source: Swift code
ja: スウィフトコード

source: Swift code and Objective-C code are conditionally compiled in different ways.
ja: スウィフトコードとObjective-Cコードは、異なる方法で条件付きコンパイルされます。

source: Swift code can be conditionally compiled using conditional compilation blocks.
ja: スウィフトコードは、条件コンパイルブロックを使って条件付きコンパイルされることができます。

source: Swift code can use the availability of APIs as a condition at run-time.
ja: スウィフトコードは、APIの有効性をひとつの条件として使うことが実行時に可能です。

source: Swift code uses var and let to control mutability, so it doesn’t need both classes.
ja: スウィフトコードは、varとletを使って可変性を制御します、それでそれは両方のクラスを必要としません。

source: Swift constant stored properties and computed properties become read-only Objective-C properties.
ja: スウィフトの定数保存プロパティと計算プロパティは、読出し専用Objecive-Cプロパティになります。

source: Swift declarations marked with the private or fileprivate modifier do not appear in the generated header.
ja: privateまたはfileprivate修飾子で印される宣言は、生成されたヘッダの中に現れません。

source: Swift deinitializers are called automatically, just before instance deallocation happens.
ja: スウィフトデイニシャライザは、ちょうどインスタンスの割り当て解除が起こる前に、自動的に呼ばれます。

source: Swift enumerations conforming to the Error protocol and declared with the @objc attribute produce an NS_ENUM declaration, as well as an NSString constant for the corresponding error domain in the generated header.
ja: Errorプロトコルに準拠していて@objc属性で印されるスウィフト列挙は、生成ヘッダにおいてNS_ENUM宣言、それだけでなく対応するエラードメインに対するNSString定数を生み出します。

source: Swift has the following buffer pointer types:
ja: スウィフトは、以下のバッファポインタ型を持ちます：

source: Swift imports C unions as Swift structures.
ja: スウィフトは、C共用体をスウィフト構造体としてインポートします。

source: Swift imports Objective-C declarations of NSDictionary that don’t specify a class qualification for the key type as a Dictionary with the Key type AnyHashable.
ja: スウィフトは、キー型に対してクラス資格を指定しないNSDictionaryのObjective-C宣言を、Key型AnyHashableを持つDictionaryとしてインポートします。

source: Swift imports any C enumeration marked with the NS_ENUM macro as a Swift enumeration with an Int raw value type.
ja: スウィフトは、NS_ENUMマクロで印を付けられるどんなCの列挙でも、生の値型Intを持つスウィフト列挙としてインポートします。

source: Swift imports any C structure declared in a C header as a Swift structure.
ja: スウィフトは、Cヘッダにおいて宣言されるどんなC構造体もスウィフト構造体としてインポートします。

source: Swift imports any function declared in a C header as a Swift global function.
ja: スウィフトは、Cヘッダにおいて宣言されるどんな関数もスウィフトのグローバルな関数としてインポートします。

source: Swift imports bit fields in structures, such those found in Foundation’s NSDecimal type, as computed properties.
ja: スウィフトは、構造体においてビットフィールド、FoundationのNSDecimal型において見つけられるものなどを、計算プロパティとしてインポートします。

source: Swift initializers and instance methods become Objective-C instance methods.
ja: スウィフトのイニシャライザとインスタンスメソッドは、Objective-Cインスタンスメソッドになります。

source: Swift is designed to provide seamless compatibility with Cocoa and Objective-C.
ja: スウィフトは、ココアとObjective-Cに継ぎ目のない互換性を提供するように設計されます。

source: Swift methods and properties that are marked with the internal modifier and declared within a class that inherits from an Objective-C class are accessible to the Objective-C runtime.
ja: Objective-Cクラスから継承するクラスの内部で宣言されてinternal修飾子で印されるスウィフトのメソッドとプロパティは、Objective-Cランタイムへとアクセス可能です。

source: Swift methods that throw errors become Objective-C methods with an NSError ** parameter.
ja: エラーをスローするスウィフトメソッドは、NSError **パラメータを持つObjective-Cメソッドになります。

source: Swift nonoptional types are annotated as __nonnull.
ja: スウィフトの非オプショナル型は、__nonnullとして注釈を付けられます。

source: Swift numeric types (Int, Float, and so on.)
ja: スウィフト数値型（Int、Float、など）。

source: Swift optional types are annotated as __nullable.
ja: スウィフトのオプショナル型は、__nullableとして注釈を付けられます。

source: Swift properties are strong by default.
ja: スウィフトプロパティは、特に何もしなければ強いです。

source: Swift provides default implementations of the == and === operators and adopts the Equatable protocol for objects that derive from the NSObject class.
ja: スウィフトは、==と===演算子の省略時の実装を提供します、そしてEquatableプロトコルをNSObjectクラス由来のオブジェクトに対して採用します。

source: Swift provides equivalents of C primitive integer types—for example, char, int, float, and double.
ja: スウィフトは、Cの基本の整数型の等価物を提供します ― 例えば、char、int、float、そしてdouble。

source: Swift type methods become Objective-C class methods.
ja: スウィフトの型メソッドは、Objective-Cクラスメソッドになります。

source: Swift type properties become Objective-C properties with the class property attribute.
ja: スウィフト型プロパティは、classプロパティ属性を持つObjective-Cプロパティになります。

source: Swift uses optionals to guard against such unsafe behavior.
ja: スウィフトは、オプショナルを使用してこのような安全でない挙動の発生を防ぐことができます。

source: Swift variable stored properties become read-write Objective-C properties.
ja: スウィフトの変数保存プロパティは、読み書き両用のObjective-Cプロパティになります。

source: Swift vends its APIs—such as from a framework—as Swift modules.
ja: スウィフトは、そのAPIを ― 例えばフレームワークから ― スウィフトモジュールとして売り渡します。

source: Swift will see every header you expose publicly in your umbrella header.
ja: スウィフトは、あなたがあなたのアンブレラヘッダにおいて公的に露出するあらゆるヘッダを見るようになります。

source: Swift wraps these returned Core Foundation objects in an Unmanaged<Instance> structure.
ja: スウィフトは、これらの返されたコアファウンデーション・オブジェクトをUnmanaged<T>構造体に包みます。

source: Swift-style variadics
ja: スウィフト形式の可変長引数

source: Swift’s compatibility with Objective-C lets you create a project that contains files written in either language.
ja: Objective-Cとのスウィフトの互換性は、あなたにどちらの言語ででも記述されるファイルを含むプロジェクトをつくらせます。

source: Taking the previous example, you can check availability in an if statement to call requestWhenInUseAuthorization() only if the method is available at runtime:
ja: 以前の例をとって、あなたは有効性をif文の中で確認して、requestWhenInUseAuthorization()をそのメソッドが実行時に有効である場合にのみ呼び出すことができます。

source: Target-Action
ja: ターゲット-アクション

source: Target-action is a common Cocoa design pattern in which one object sends a message to another object when a specific event occurs.
ja: ターゲット-アクションは、特定のイベントが起こる時にあるオブジェクトが別のオブジェクトにメッセージを送る場合の、一般的なココア・デザインパターンです。

source: That way, Swift can handle memory management for you.
ja: そのように、スウィフトはあなたの代わりにメモリ管理をうまく取り扱うことができます。

source: The @IBOutlet attribute no longer implicitly declares a property as optional and weak.
ja: @IBOutlet属性はもはやプロパティを暗黙的にオプショナルや弱いとして宣言しません。

source: The AnyHashable type is used by Swift when importing Objective-C declarations with an unspecified or id type that cannot be otherwise be imported as Any because the type needs to conform to the Hashable protocol.
ja: AnyHashable型は、スウィフトによって、idまたは未指定型を持つObjective-C宣言をインポートする時に使われます、それはそうでなければAnyとしてインポートされることができません、なぜならその型はHashableプロトコルに準拠する必要があるからです。

source: The Cake structure is imported with a memberwise initializer that you can use to initialize the structure with custom values for its fields, as seen below:
ja: Cake構造体は、メンバー関連イニシャライザでインポートされます、それはあなたが構造体をそれのフィールドに誂えの値を使って初期化するのに使うことができるものです、下で見られるように：

source: The NSCoding protocol requires that conforming types implement the required initializer init(coder:) and the required method encode(with:).
ja: NSCodingプロトコルは、準拠している型が必須イニシャライザinit(coder:)および必須メソッドencode(with:)を実装することを必要とします。

source: The Unmanaged<Instance> structure provides two methods to convert an unmanaged object to a memory managed object—takeUnretainedValue() and takeRetainedValue().
ja: Unmanaged<T>構造体は、管理されないオブジェクトをメモリ管理されたオブジェクトに変換するために、２つのメソッドを提供します ― takeUnretainedValue()とtakeRetainedValue()。
